cosmoi.org
#+Title: Cosmoi
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.

#+Options: toc:nil date:t num:nil
#+Options: html-style:nil
#+Options: html-postamble:t
#+Options: tex:dvisvgm

** Blogging with a single org-file                                                           :post:
:PROPERTIES:
:TITLE: Blogging with a single org-file
:EXPORT_FILE_NAME: bloggingwithasingleorgfile.html
:INDEX_DATE: <2018-08-15 Wed 23:19>
:ID:       64a920ed-1914-4e64-997d-837f14815cdd
:END:

This blog is generated by a single org-file that can be found
[[https://github.com/mroman42/cosmoi/blob/master/cosmoi.org][here]]. The file contains some org-babel elisp blocks that export the
HTML files, create the index and populate the RSS feed. This is
possible using [[https://orgmode.org/manual/Tags.html#Tags][tags]] that signal whether any specific header is a post,
[[https://orgmode.org/manual/Property-syntax.html][properties]] that store the name and the html direction of the articles,
and the =org-map-entries= function, which maps a function over all
headers.

