bloggingwithasingleorgfile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-23 Sun 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogging with a single org-file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Blogging with a single org-file</h1>
<p>
This blog is generated by a single org-file which can be found
<a href="https://github.com/mroman42/cosmoi/blob/master/blog.org">here</a>. The file contains some org-babel elisp blocks that export the
HTML files, create the index and populate the RSS feed. This is
possible using <a href="https://orgmode.org/manual/Tags.html#Tags">tags</a> that signal whether any specific header is a post,
<a href="https://orgmode.org/manual/Property-syntax.html">properties</a> that store the name and the html direction of the articles,
and the <code>org-map-entries</code> function, which maps a function over all
headers.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-08-15 Wed 23:19. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
